Autodesk.Revit.DB.TextRange.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TextRange.End
The index of the first character after the end of the range
Since:
2017

Autodesk.Revit.DB.TextRange.Length
The length of the range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for length is negative.
Since:
2017

Autodesk.Revit.DB.TextRange.Start
The start index of a range within the Autodesk.Revit.DB.FormattedText.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for start is negative.
Since:
2017

Autodesk.Revit.DB.TextRange.#ctor(System.Int32,System.Int32)
Constructs a TextRange with input start and length.
Remarks:
The input value for start as well as length should not be negative.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for start is negative.
-or-
The given value for length is negative.
Since:
2017

Autodesk.Revit.DB.TextRange.#ctor
Constructs a TextRange with default values for start and length.
Remarks:
The start and length are set to be 0 by default.
Since:
2017

Autodesk.Revit.DB.TextRange.#ctor(Autodesk.Revit.DB.TextRange)
Constructs a copy of the input TextRange object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.TextRange
An object that is used to identify a range of characters in a
Autodesk.Revit.DB.FormattedText.
Remarks:
A TextRange consists of a start, which is a zero-based index into the text,
and a length, which is the number of characters in the range.  The length can be zero.
Since:
2017